[
    {
        "url": "https://www.instagram.com/p/Cl_uYbTsc7P/?hl=en",
        "review": "I’M IN LOVE 🤩 Christmas came early when @caraway_home sent me their non stick, non toxic cookware to try out! \n\nNot only are these pieces heavy duty and well made, they’re GORG. You know I had to get that white and gold to accompany my basic b lifestyle but they have so many colors to choose from!\n\nIf you’re looking for a big gift for someone in your life our want to treat yourself to cleaner cookware, I’ve got a 10% promo code linked in my profile that is valid until 1/3 (but note that that the shipping cutoff for Christmas is this week, 12/14!)."
    },
    {
        "url": "https://www.instagram.com/reel/Cpavo8pgWEJ/?utm_source=ig_web_copy_link",
        "review": "Firm believer that that things can be both aesthetic and functional, and that romanticizing the little, everyday things makes life more fun. So here is me doing the dishes with my favorite @doraihome dish pads on the counter and the morning sunlight streaming in through the sun tunnel ☀️\n\nI purchased the dorai dish pad last year after getting fed up with the mold and mildew that had taken up a permanent residence on our old dish rack, and we loved it so much that we ended up buying another one. The fact that they dry instantly (meaning no more mold and mildew) has been a game changer for us, and we love that they’re collapsible so we can fold them up when not in use. We were already big fans of dorai, so I was super excited when they reached out about trying their newest addition: the dish pad rack (g i f t e d). We wash a lot of dishes by hand, so I have been loving all of the extra space that this rack frees up on the dish pads. I also love that it’s open on the bottom, so water slides right down onto dish pad and dries instantly. \n\nIf you love your dorai dish pad, you’ll definitely love this new addition, and you can use the code STAYHOMESTYLE15 to save 15% off your order!\n.\n.\n.\n#dorai #doraihome #doraidishrack #doraidishpad #fable #dinewithfable #fabledinnerware #carawayhome #caraway #carawaycookware #carawayambassador #cutco #cutcoknives #cutcochefknife #amazonhome #amazonfashion #dishrack #romanticizeyourlife #smmakelifebeautiful #cljsquad #deltafaucet #loweshomeimprovement #anthropologie #anthroliving #quartzcountertops #samsungtheframe #samsungframetv #kitchenisland"
    },
    {
        "url": "https://www.instagram.com/reel/CnpE3NMKGCb/?utm_source=ig_web_copy_linkk",
        "review": "GIVEAWAY CLOSED\nWinner @madamebarry \n\nEPIC GIVEAWAY!!\n\nRead the caption and enter to win!\n\nYou will fall in love with this food storage set from our genius friends @caraway_home ! This gorgeous set has 14 pieces 😲 of glass and non-toxic food storage with air-tight covers, storage and straps included.\nThese glass food storage containers are dishwasher, oven, freezer and microwave safe. They are incredible and have sold out repeatedly. Today we are teaming up to give away a full set of these beauties in your color of choice\n( a $245 value)\n\nTo enter:\n1. Like and Save this post\n2. Follow @betterfoodguru and @caraway_home \n3. Comment and Tag a friend!\n\nThe fine print:\nThis giveaway is not endorsed by Meta. It is open to US residents only age 18 and over. The contest closes on Jan 26th at midnight. The winner will be chosen at random on the 27th and announced on this post and in stories. @betterfoodguru and @carawayhome will never reach out to you directly in dm. Beware of fake accounts who do this.\n\n#caraway #carawayhome #nontoxicliving #nontoxichome #foodstorage #homedecor #kitchen #foodprep #leftovers #decor #gifted #homecooking #organization #fridgeorganization"
    }
]