[
    {
        "review": "Hi folks, I have been eyeing the caraway cookware set for a bit but haven’t been able to pull the trigger on it. Anyone here who uses it and could share some feedback? Really appreciate it :)",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "They're ceramic nonstick, so the nonstick will fail in about a year, two years if you're very careful with it and don't cook much. Disposable pans shouldn't cost $100 each, you can get lifetime pieces for that price and super-premium ones like Demeyere for a little more.\nThe colored ceramic on the outside of the pans reportedly stains and scorches very easily and is much harder to clean than stainless steel or glazed enamel. You can't use abrasives to clean them without damaging the finish, and discoloration isn't covered by the (one-year, laughably short for premium cookware) warranty. So the pretty colored finishes that are the main selling point won't look good once you start using them.\nCheck old threads in this sub where Caraway buyers lament how bad their pans look after a few months. Or here's a YouTube review that shows how easily they stain.\nThe other issue is a whole set of nonstick pans just doesn't make sense, because while they're convenient for a few things like eggs or delicate fish, for 95% of cooking applications there is no danger of sticking and nonstick is clearly inferior to other common types of pans. Here's a pretty good article that explains why. Nonstick sets are marketed heavily because they're a boondoggle for the cookware industry, since buyers will just need to replace them with another set within a few years.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "False advertising! Do not buy! All the reviews they have which are all great were taken right after people received their pans (like myself). They ask you to review right after your purchase. Then 2-3 weeks later they turn to crap. Marks inside and outside the pan. All caraway did for me was give me cleaning advice, which did not even work! And I was initially sent a pan with a chip on the paint! They sent me a new one, but once I complained about all the marks I was getting on my pans they were reluctant to do anything for me because it was outside of their 30-day policy. Don’t waste your good money!",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "The problem is the price is just in the right range to not seem too good to be true but by all accounts in here they are. Good to know",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "Looking at a 5.5 quart stainless steel dutch oven. For disc I'd most likely get Fissler. For clad, Demeyere Industry. I own both of these brands already in other pieces but can't decide which construction would be best for a dutch oven. If using it for thick soups or chili, would the conductive sidewalls of clad be better? Or would the thick disc be better at keeping an even simmer throughout the whole pot (not just the center sitting over the flame)? I do have a Le Creuset dutch oven in a larger size and often find only the center of the pan at a simmer resulting in having to stir often.\nWhile I would use this for thicker recipes like chili, I'd also use it for tomato sauce or thin soups as well.\nI cook on gas.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "Ceramic coating means it won't last long. Personally I'd skip it and if you want a non-stick, get a teflon pan. They work better.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "This is literally the worst set of pans I’ve ever owned. At first they were great, but I’ve had them for a little over a year and now they are complete garbage. EVERYTHING STICKS, this is not even an exaggeration. I can’t even cook bacon drowning in oil without having to peel and scrape it off the pan to turn it over. It was a cute set, but seriously don’t waste your money.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "At first, these were the best non-stick pans we ever used, with great heat distribution and retention. The idea of a non-stick pan without the chemicals is also very appealing.\n\nAfter about 3 months of use, one of the pans started to lose its non-stick property, and after six months, everything sticks to it. We've followed the instructions carefully: letting the pans cool before cleaning; using soapy water and a soft sponge to clean; not using any hard objects to stir. So these extra care steps appear not to make any difference to longevity.\n\nA second issue is that only the inside resists stains. About a week in, we used turmeric in a sauce, and the outside now has an apparent permanent yellow stain. Given part of the appeal of the pans is the look, this seems a bit of an oversight in design.\n\nIn all then, some major short-comings when each pan effectively costs $100 each. The initial non-stick was excellent: best we've had. At this point though, we reckon we'd have been better off with cheaper pans that are more durable.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "UPDATE: I originally gave this 3 stars but had to down grade.\nDon’t throw your money away on this flawed design no matter how pretty they look. In addition to my original review i will add that the paint is now chipping. I have a gas stove. The flat lid design is also a disaster when when it comes to all the condensation. The water has no where to go so you either get a huge puddle of water on your stove/counter or right back in your food. These are also all way to heavy so once you start adding food to them good luck trying to lift the frying pan with one hand. I hope I can save the headache for anyone else’s.\n\nI have to had I gave this product 3 stars because you’re basically paying for the pretty product and the “add-ons” that don’t really work. The lid organizer is silly and doesn’t work on most cabinets. The pot organizer was a super manipulative image. They are individual U shaped pieces of hard plastic not one large piece. But what did it for me was the handles on the Dutch oven being hot as heck when I was using it on the stove top. I assumed they might’ve been heat resistant for the price. Oh, well. I’ll still use this set and at least look like I’m cooking in a Pinterest picture.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "Horrible experience, I have ordered the set with 4 and one of them has defects. I contacted the customer service and they told me that it can’t be returned or replaced. It felt like they are ignoring the issue and saying that I’m trying to get a brand new one for nothing. If you couldn’t control your product quality, and have a such horrible customer service, how could you sell. Don’t get this pan. It only worthy to look and no practicality",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "I went from a cast iron skillet to this Caraway set and I'm incredibly impressed. They are so easy to cook with, easy to clean and the sleek design makes it a joy to own.\nI even have them sitting out on my stove because I love the sleek design so much. I will be getting the smaller set of pots next, so all my pots and pans are from Caraway. Although pricey, I consider this a solid investment in cookware and can only recommend you buy this.",
        "url": "https://www.reddit.com/r/cookware/comments/rwu013/thoughts_on_the_caraway_cookware_set/"
    },
    {
        "review": "Not only is this set beautiful aesthetically, the quality is top notch. I don’t know how Caraway does it, but making them non-stick while also non-toxic is amazing. I have read so much about the harmful chemicals in non-stick cookware, but hate having to sacrifice the non-stick aspect, and with this set I don’t have to!\n\nI love that they are oven compatible and I also love the pan rack and lid holder to keep my cabinets organized (messy cabinets are a huge pet peeve of mine).\n\nThis is my first Caraway purchase, but I will be back for the bakeware. Chefs kiss, Caraway!!!",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    },
    {
        "review": " have had some of the best pans in the past. But I love these pans even more. I just wish the would come with some kind of instructions. Is best just to used them in Medium heat- they do not take long to heat. I would not use them in higher heat. Also wash them with the soft part of a sponge. If you use the scratchy part in the bottom of the pan- they will scratch. Best pans ever. Very happy here.",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    },
    {
        "review": "Well, these pots were a huge disappointment. Wanted to make the switch to non-toxic, non-stick pans but I guess that's just a unicorn that doesn't exist. I have several gripes about these, but I'll start with the positives.\n\nYays\n1. Aesthetic and modern designs\n2. Technically cooks my food but the process is iffy\n\nAnd now on to the Nays:\n\n1. They are not non-stick. Eggs stick like crazy.\n2. The handles get really hot. Instead of throwing in all that extra garbage (the cork trivet, canvas hanging thingy and the magnetic organizer...almost all of this went into the trash for us) I wish they would've included silicone or even cloth handle covers.\n3. See #2. All the excess STUFF that came with the set was ridiculous. I couldn't personally use anything except the cork trivets.\n4. You have to hand wash them, which is fine, but you have to be careful around the bolts that keep the handles on. Food can get stuck.\n\nBottom line - I'm not happy with the purchase and regret spending this much money on a set of pans that I don't love.",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    },
    {
        "review": "It has been only 10 days since I started using these cookware. They are heavy and good looking for sure. One of them (10.5\"Frying Pan) is scratched inside somehow and lost non-stick condition completely... I was very surprised to see this. I was careful when I washed them so I don't know how this happened so fast... I am disappointed.",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    },
    {
        "review": "Very nice cookware, as long as you don’t expect anything to boil over - if it does it will roast the finish and stain the hell out of the coating. Sadly it is outside of the return window and there is no way to contact the seller to get a replacement. Very disappointing.",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    },
    {
        "review": "I gave through my wife on her birthday in mid august. Less than one month of use and the large sauce pan has two chips in it. No metal utensils have touch the pans. We loved them otherwise\n",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    },
    {
        "review": " bought these pots & pans thinking they were a premium set, after all they look great, but when I used them to cook some chicken, the food stuck to the pan and was difficult to get clean. I called Caraway and their response was that they are non stick pans but you should use oil anyway. I asked them to replace the discolored frying pan and they wanted pictures (which I sent) and never heard back from them. Big disappointment. They claim non-stick but with an asterisk*. I call B.S. on them for making false claims.",
        "url": "https://www.amazon.com/product-reviews/B08XM1B6ZX/ref=cm_cr_unknown?ie=UTF8&filterByStar=three_star&reviewerType=all_reviews&pageNumber=1#reviews-filter-bar"
    }
]