[
    {
        "url": "https://www.youtube.com/shorts/MgP3jTWtupA",
        "review": "Oh my gosh, you guys, I've been looking at that cookware at Crate and Barrel for a while. So, Karaway is a 100% non-toxic ceramic cookware. It comes with all the organizers at no cost, so you can storage your pots and pans or you can even display them if you prefer that. Looks beautiful with the lids. It also has this organizer and I just put them inside of my cabinet. They have so many amazing colors. It was really hard to pick, so I went with Piracota. It's kind of like a mix of pink and orange. It's a really beautiful color. They don't stick. You can fry your egg. It will like slide. Don't have to worry about sticking. And these four pieces is all you need to cook and that is perfect for my minimal approach."
    },
    {
        "url": "https://www.youtube.com/shorts/2_3fJzmIx2U",
        "review": "My Carraway pots and pans are one of my all-time favorite purchases and they are running their once a year savings event right now. Not only does a cookware look beautiful while cooking or serving, but I have honestly never used anything with a better nonstick surface or easier cleanup. Each set comes with its own organizers for easy storage as well. Shop them all via the link in my story highlight."
    },
    {
        "url": "https://www.youtube.com/shorts/Cb7eS86jBfE",
        "review": "So I decided to put my caraway pan to the test by making brownies. I'm not gonna coat it use butter Spray nothing. So I'm just gonna make the brownies I prepared them according to instructions and then I poured it into the pan and evened it out put it into the Oven I cooked it according to the big time that called for on the box and it came out perfectly So when I went ahead to flip it, I waited the five minutes and it came out clean There was nothing left on the pan. But when I went to clean the pan I would just use water on my finger and it came all up."
    },
    {
        "url": "https://www.youtube.com/shorts/87_t2vK6YhQ",
        "review": "my adult life of 30 years, I've never bought a set of cooking pans myself until now. this was a big adult purchase for me. I went with the caraway set. they were very expensive. I got them from crate and barrel. they come with the gold handles which I think are gorgeous. it's a limited edition set I believe. there were many different reasons why I went with this brand. from shopping around, I've yet to see another set that comes with this lid storage which I think is so convenient. another thing I loved about this set are the magnetic pan holders. this is just going to keep me organized. as you can see, this cabinet was not organized before. my pots and pans were just thrown in there. everything is so dirty and old. I've had these for probably nine years so I got rid of almost all of them and I just want to start fresh. I want to be more minimal in my life and so I'm just keeping these and that way it's easy for me to see and I know exactly where everything is. as I was putting them away, I noticed a scratch on the pot so that's a bummer but overall they are beautiful and I never thought I would say this but I can't wait to start cooking."
    },
    {
        "url": "https://www.youtube.com/shorts/5bRfLxmXJTY",
        "review": "okay on today's episode of things I bought myself for Christmas slash my birthday instead of buying other people gifts the carryaway merry-go-round set okay so I definitely wanted to do an unboxing for you guys because they took they damn time on this packaging like they really did it the up like get into it like I definitely heard about this brand on Instagram and I was just like let me see what it's about cuz it just looks so good but the quality is 10 out of 10 y'all like it's great ball like approved like you could definitely hit somebody upside the head with it I don't even know if y'all need to know that but it's it's not all the way like super cast-iron heavy but it's definitely heavyweight enough to get the job done if you you want that type of time it also comes with I don't know what this exactly is called but it's of course to place your pots on instead of placing them directly on the counter damn just recording moving fast but this is the saute pan it comes with a lid all of the pans come with leaves which is great has carryaway engraved like it just gives luxury like everything just sits so well up next"
    },
    {
        "url": "https://www.youtube.com/shorts/Cd2Qqo9wuPg",
        "review": "This is what you get when you make an omelette on a caraway family. It's beautiful."
    },
    {
        "url": "https://www.youtube.com/shorts/dEbC1GqApTI",
        "review": "Thanks for watching!"
    },
    {
        "url": "https://www.youtube.com/shorts/Cb7eS86jBfE",
        "review": "So I decided to put my caraway pan to the test by making brownies. I'm not gonna coat it use butter Spray nothing. So I'm just gonna make the brownies I prepared them according to instructions and then I poured it into the pan and evened it out put it into the Oven I cooked it according to the big time that called for on the box and it came out perfectly So when I went ahead to flip it, I waited the five minutes and it came out clean There was nothing left on the pan. But when I went to clean the pan I would just use water on my finger and it came all up."
    },
    {
        "url": "https://www.youtube.com/shorts/s0v2-Dv4YKs",
        "review": "Here we go. This is a, what's it, Carraway brand? Carraway, that's it. Carraway brand. It's nice and heavy. It's a great fry pan. Yeah. And it's also a good steam pan because it's got a tight lid with a little steam port right here for steaming vegetables or rice or anything. Oh yeah. It looks like that'd be easy to clean maybe. I don't know. Oh yeah. It's got a nice surface. No stick surface. And it's really heavy. Came with its own little. Oh, it came with that. That's a nice cool thing. Yeah. And then I'm just going to try the handle real quick. It looks like that's thick and okay. Yeah. It's got a really good weight to it. Yeah. That is pretty heavy. Oh yeah. Awesome."
    },
    {
        "url": "https://www.youtube.com/shorts/63XNoJGZ1sY",
        "review": "Ask who do this, but everybody know who, girl that you is Beautiful, I just want you to know, you're my favorite girl Oh yeah, there's something about you Beautiful, I just want you to know, you're my favorite girl Oh yeah, there's something about you When I see my baby vooshie, I get foolish Smack her, and it tries to pursue it Homeboy, she takin', just move it, I asked her nicely, don't make the dog lose it We just blow dro and keep the flow moving"
    },
    {
        "url": "https://www.youtube.com/shorts/lhlpciwneAw"
    },
    {
        "url": "https://www.youtube.com/shorts/mnU0eP5Wuxc",
        "review": "It has 100% non-toxic ceramic cookware. The cookware sets come with organizers at no extra cost. The colors are so beautiful and complement any home. I chose the sage color and I am really, really obsessed. It's so worth the investment in your kitchen and health."
    },
    {
        "url": "https://www.youtube.com/shorts/smGgR6VMPSM",
        "review": "Gorset is, I'm obsessed with it. Like, I have this issue where I want my Paws and Pants just to be like chic and amazing, but I get like nervous about whether I'm gonna ruin them. But these like, they're just so stunning and they're amazing quality. And I love that it comes with, I think it's four items, which makes it so easy. Like if you just moved or if you're moving and you just don't have like quality pants, those are such a good deal. Okay, another home lover gift is, and I've talked about this before, but it just keeps going on sale. And I think it's such a good gift is this wine purifier and decanter."
    }
]